---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotSlopeReferencePointIsSingular
source: html/5ac22a0f-5d83-bf91-d7db-75b17138c784.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotSlopeReferencePointIsSingular Property

The highlighted Spot Slope references an element point that is singular.

## Syntax (C#)
```csharp
public static FailureDefinitionId SpotSlopeReferencePointIsSingular { get; }
```